{
  //characters
  "characters.Demetrius": "ex-husband",
  "characters.Robin": "ex-wife",
  //dialogue - demetrius
  "dialogue.demetrius.dating_Robin_memory_oneday": "Robin told me that you two are dating now.#$b#I hope that your analytical skills exceed mine here, and that your relationship achieves a satisfactory level of happiness.",
  "dialogue.demetrius.married_Robin": "Congratulations, @. I hope you and Robin are very happy together.",
  "dialogue.demetrius.dating.GreenRain": "Don't mind me, @. I'm just collecting some samples. This may be a once-in-a-lifetime opportunity!$7#$e#Erm... If you see my wife, can you tell her I'm okay?$7",
  "dialogue.demetrius.dating.Resort_Chair": "Are you here to work, @? There are many fascinating opportunities here!",
  "dialogue.demetrius.dating.pamHouseUpgradeAnonymous": "Robin won't even tell *me* who paid for Pam's new house!#$e#I'm glad she's so loyal to her word...$h",
  "dialogue.demetrius.dating.Mon_inlaw_Maru": "It's hard to do good science without Maru's help...#$b#But she seems to be happy.",
  "dialogue.demetrius.dating.Thu": "How's the farming business going? It's parsnip season, isn't it?#$e#I can imagine it take a lot of effort, working outdoors with plants all day.",
  "dialogue.demetrius.dating.Wed_2": "Do you think emotions follow a predictable pattern?#$b#I've been trying to graph Robin's, but the results are inconclusive so far.",
  "dialogue.demetrius.dating.Sun_2": "I've developed a hypothesis about Robin's mood fluctuations, but I need at least another month of observation to confirm it.#$b#I'm not sure when I'll find the time, though.",
  "dialogue.demetrius.dating.summer_Tue": "Robin mentioned she's upset about how much I’ve been working. I haven't had the chance to fully analyze her emotions yet.",
  "dialogue.demetrius.dating.summer_Thu": "I've been analyzing the ecosystem around Stardew Valley for years now. The data is... overwhelming. There's so much left to study.",
  "dialogue.demetrius.dating.fall_Thu": "Robin seems angry these days.#$b#Do you think it’s possible that, like a plant under stress, she’s reacting to an external factor I haven't yet accounted for?",
  "dialogue.demetrius.dating.fall_Wed": "When my research slows down, I'll need to set aside some time to really evaluate Robin's apparent unhappiness.",
  "dialogue.demetrius.dating.winter_Mon": "I've developed a hypothesis about Robin's mood fluctuations, but I need at least another month of observation to confirm it.#$b#I'm not sure when I'll find the time, though.",
  "dialogue.demetrius.dating.winter_Sun": "Feel free to harvest as much lumber and stone from this area as you please.#$b#I've completed my research on them.",
  "dialogue.demetrius.dating.winter_Fri": "I've been analyzing the ecosystem around Stardew Valley for years now. The data is... overwhelming. There's so much left to study.",
  "dialogue.demetrius.separated.dating_Robin_memory_oneday": "Robin told me that you two are dating now.#$b#I hope that your analytical skills exceed mine here, and that your relationship achieves a satisfactory level of happiness.",
  "dialogue.demetrius.separated.married_Robin": "Congratulations, @. I hope you and Robin are very happy together.",
  "dialogue.demetrius.separated.GreenRain": "Don't mind me, @. I'm just collecting some samples. This may be a once-in-a-lifetime opportunity!$7",
  "dialogue.demetrius.separated.Resort_Chair": "Are you here to work, @? There are many fascinating opportunities here!",
  "dialogue.demetrius.separated.pamHouseUpgradeAnonymous": "Robin won't tell anyone who paid for Pam's new house!#$e#She's always been loyal to her word...",
  "dialogue.demetrius.separated.Mon_inlaw_Maru": "It's hard to do good science without Maru's help...#$b#But she seems to be happy.",
  "dialogue.demetrius.separated.Thu": "How's the farming business going? It's parsnip season, isn't it?#$e#I can imagine it take a lot of effort, working outdoors with plants all day.",
  "dialogue.demetrius.separated.Wed_2": "I suspect I'm at fault for my divorce, but the variables leading to this outcome remain unclear.",
  "dialogue.demetrius.separated.Sun_2": "This valley's ecosystem holds secrets that could revolutionize environmental science.#$b#I can't let my personal setbacks deter me.",
  "dialogue.demetrius.separated.summer_Tue": "I've calculated that without marital obligations, I can increase my research output by 37.8%.#$b#At least I have that silver lining.",
  "dialogue.demetrius.separated.summer_Thu": "I've calculated that without marital obligations, I can increase my research output by 37.8%.#$b#At least I have that silver lining.",
  "dialogue.demetrius.separated.fall_Thu": "This valley's ecosystem holds secrets that could revolutionize environmental science.#$b#I can't let my relationship setbacks deter me.",
  "dialogue.demetrius.separated.fall_Wed": "Robin always said I was married to my work. I suppose now it's official, isn't it?#$b#...That was an attempt at humor.",
  "dialogue.demetrius.separated.winter_Mon": "The Department of Environmental Sciences at Zuzu University has expressed interest in my research#$b#My hard work has finally started paying off.#$b#This could be huge for my career.",
  "dialogue.demetrius.separated.winter_Sun": "Feel free to harvest as much lumber and stone from this area as you please.#$b#I've completed my research on them.",
  "dialogue.demetrius.separated.winter_Fri": "Robin and I... we're no longer together. I suspect I'm at fault, but the variables leading to this outcome remain unclear.",
  //dialogue - maru
  "dialogue.maru.dating_Robin_memory_oneday": "Wow, you and Mom, this is... unexpected. I always thought you and I... nevermind.#$e#You and Mom seem very happy though, so that’s all that really matters.",
  "dialogue.maru.married_Robin": "Never imagined you'd end up being my stepdad. Life's funny sometimes.^Never imagined you'd end up being my stepmom. Life's funny sometimes.",
  "dialogue.maru.separated.dating_Robin_memory_oneday": "Wow, you and Mom, this is... unexpected. I always thought you and I... nevermind.#$e#You and Mom seem very happy though, so that’s all that really matters.",
  "dialogue.maru.separated.married_Robin": "Never imagined you'd end up being my stepdad. Life's funny sometimes.^Never imagined you'd end up being my stepmom. Life's funny sometimes.",
  "dialogue.maru.separated.Fri": "Mom and I are sharing my room.#$b#It's a little crowded but it's nice to have some girl time.",
  "dialogue.maru.separated.Sun": "Mom is single and ready to mingle, again.#$b#She's moved into my room until she figures something out.",
  "dialogue.maru.separated.Mon2": "Mom moved into my room.#$b#It's nice to have some help keeping it clean.",
  "dialogue.maru.separated.Wed2": "Mom and I are cozying up in my room.#$b#It's a bit cramped, but it's fun to have some quality time together.",
  "dialogue.maru.separated.Tue4": "Mom and I are sharing my space.#$b#It's a little snug, but she's been a huge help on my projects.",
  "dialogue.maru.separated.Wed4": "Mom is single again and has decided to share my room.#$b#I think she really appreciates the companionship",
  "dialogue.maru.separated.Wed6": "Mom and I are cozying up in my room.#$b#It's a bit cramped, but it's fun to have some quality time together.",
  "dialogue.maru.separated.Thu6": "Mom and I are sharing my space.#$b#It's a little snug, but it's great to have some girly bonding.",
  "dialogue.maru.separated.Tue8": "Mom and I are making do in my room.#$b#She's really encouraging about my projects.",
  "dialogue.maru.separated.Fri8": "Mom is single again and has decided to share my room.#$b#My furniture has never been in better shape!",
  //dialogue - robin core
  "dialogue.robin.core.AcceptBouquet": "You want to get serious?#$b#Me too!$1#$b#I'm so glad you feel the same way.$l",
  "dialogue.robin.core.Sun6": "Sorry if I seem grumpy today. Demetrius and I were up arguing most of the night.$s#$b#*sigh* Sorry, I didn't mean to dump that on you. Thanks for listening though. I appreciate it.",
  "dialogue.robin.core.dating_Robin": "Let me tell Demetrius and the kids that we're dating.#$b#They should hear it from me first.",
  "dialogue.robin.core.dating_Robin_memory_oneday": "I'm feeling very scattered today.$l",
  "dialogue.robin.core.dating_Robin_memory_oneyear": "We've been dating for a year already! We should celebrate tonight.$h",
  "dialogue.robin.core.FlowerDance_Accept_Spouse": "Of course...#$b#*whisper* I'm glad you asked. I'll reward you later.$l",
  "dialogue.robin.core.FlowerDance_Accept": "Yes, I'd love to dance with you!",
  "dialogue.robin.core.divorced": "Leave me alone. Thanks to you, I'm a three time loser.$a#$b#Please, just go away.$s",
  "dialogue.robin.core.RejectBouquet_Divorced": "Get lost.",
  "dialogue.robin.core.breakUp": "I risked my marriage and family because I thought you were serious.$a#$b#I was such a fool.$s",
  "dialogue.robin.core.Mon2": "Demetrius has been really busy with his research lately. I hope starts getting more rest soon.",
  "dialogue.robin.core.Wed2": "Demetrius is always buried in his research. I wonder if his workload will ever get lighter.",
  "dialogue.robin.core.Sun2": "Demetrius has been spending a lot of late nights at the lab. He's really dedicated to his work.",
  "dialogue.robin.core.Mon4": "Demetrius is working something big, but I sometimes miss just hanging out together.",
  "dialogue.robin.core.Thu4": "I miss having dinners with Demetrius. I'm feeling less connected to him.",
  "dialogue.robin.core.Wed4": "I understand Demetrius' work is important, but there's a distance growing between us that I can't seem to bridge.",
  "dialogue.robin.core.Sat6": "Demetrius' job is more important to him than anything else. I'm grateful that I have my own career to keep me fulfilled.#$e#I really love carpentry.'",
  "dialogue.robin.core.Thu6": "Demetrius isn't spending much time with the family, but I think the kids and I are growing even closer.",
  "dialogue.robin.core.Mon6": "I have a lot of evening time to myself these days. I haven't had this much time to read since before Sebby was born.",
  "dialogue.robin.core.Wed6": "It's no secret I'm feeling lonely, but at least I have a stable life here.#$b#I'm luckier than many others.",
  "dialogue.robin.saloon.Saloon_Fri.1": "I guess Demetrius isn't coming dancing tonight.#$e#I wish he could break away from work.$2",
  "dialogue.robin.saloon.Saloon_Fri.2": "I guess I'm alone again tonight.#$e#Demetrius doesn’t seem to come dancing anymore.$2",
  "dialogue.robin.saloon.Saloon_Fri.3": "Demetrius is missing out on dancing again.#$e#Do you think he misses it?$2",
  "dialogue.robin.dateable.Sat": "Demetrius' job is more important to him than anything else. I’m glad I finally decided to move on.",
  "dialogue.robin.dateable.Thu": "I tried talking to Demetrius about spending more time with the family, but he just didn't listen. His research always came first.",
  "dialogue.robin.dateable.Mon": "Demetrius and I have decided to separate. We've filed for divorce with Mayor Lewis.#$b#I really appreciate your advice earlier. I'm at peace with our decision.",
  "dialogue.robin.dateable.Fri": "I've been sleeping in Maru's room now that Demetrius and I are divorced. It's kind of her to make some space for me.#$e#She's really wonderful.",
  "dialogue.robin.dateable.Wed": "I'm looking forward to a bright future! I hope you'll always be a part of it.",
  "dialogue.robin.greenrain.GreenRain": "Demetrius made us all very afraid of the green rain but I'm much more relaxed about it now.#$b#I'm still going to take the day off, though.$4",
  "dialogue.robin.greenrain.GreenRainFinished": "I'm not thrilled about the green rain. But I sure enjoyed a day off!$h",
  //dialogue - sebastian
  "dialogue.sebastian.drifting.separated.1": "Demetrius has been working a lot lately. It's nice that it's more quiet around here.",
  "dialogue.sebastian.drifting.separated.2": "I've noticed Demetrius has been putting in some crazy hours lately.#$b#I guess he's trying to get ahead.",
  "dialogue.sebastian.drifting.separated.3": "Mom's been asking if I've seen Demetrius. As if I leave the basement enough to notice.",
  "dialogue.sebastian.drifting.separated.4": "Demetrius has been putting in a lot of long hours. Mom seems to care but I barely notice.",
  "dialogue.sebastian.drifting.separated.5": "Demetrius used to bug me about getting out of my room more to spend time with the family.#$b#Now he's the one working all the time and is never around.",
  "dialogue.sebastian.drifting.separated.6": "Mom's cranky about Demetrius working so much. I just appreciate the peace and quiet.",
  "dialogue.sebastian.drifting.separated.7": "I actually had a conversation with Demetrius yesterday.#$b#Feels like a rare achievement these days.",
  //dialogue - robin marriage
  "dialogue.robin.marriage.spring_Tue": "The valley is so pretty in Spring. I'll enjoy the view on my walk to town for Tuesday workout.",
  "dialogue.robin.marriage.summer_Tue": "Remember that I'm taking the day off today. I'll be at the gym.#$e#It's leg day.$2",
  "dialogue.robin.marriage.fall_Tue": "The leaves are so pretty on my walk to town. Tuesdays in autumn are my favorite.",
  "dialogue.robin.marriage.winter_Tue": "It's gossip and gym day! See you this evening, honey.",
  "dialogue.robin.marriage.spouseRoom_Robin": "I'm looking for some design inspiration.#$e#I love having all of my books here.",
  "dialogue.robin.marriage.Rainy_Day_0": "Let me know if you need any help today.",
  "dialogue.robin.marriage.Rainy_Day_1": "Rainy days let you know what condition your roof is in. Luckily, we're in good shape!",
  "dialogue.robin.marriage.Rainy_Day_2": "Good morning! I got up early and made breakfast. Here you go.[194 195 201 210 211]#$e#I hope it tastes OK. I'm a better carpenter than I am a cook.$h",
  "dialogue.robin.marriage.Rainy_Day_3": "Days like this can feel really long when you're working outdoors.",
  "dialogue.robin.marriage.Rainy_Day_4": "It's pouring out there. We should lay around in bed all day.$5",
  "dialogue.robin.marriage.Rainy_Night_0": "How was your rainy day? I'm impressed that you were out there getting things done!",
  "dialogue.robin.marriage.patio_Robin": "I love having this space. I hope I figure out what to do with it some day.",
  "dialogue.robin.marriage.Rainy_Night_1": "I could really go for some fried chicken. Someone should invent that!$h",
  "dialogue.robin.marriage.Rainy_Night_2": "The sound of the rain just lulls me to sleep...",
  "dialogue.robin.marriage.Rainy_Night_3": "I made soup! I threw it out though, it was awful.$h#$b#Do you want to get takeout from Gus?",
  "dialogue.robin.marriage.Rainy_Night_4": "I'm glad you're home... Let's hop in bed and warm each other up.$5",
  "dialogue.robin.marriage.Rainy_Night_Robin": "How was your day today, dear? Are you cold?",
  "dialogue.robin.marriage.Indoor_Day_0": "This house is holding up well! It's still in great shape.",
  "dialogue.robin.marriage.Indoor_Day_1": "Good morning, @. I found this when I was out yesterday... [384 386 787 107 70 114]#$e#I hope you can use it.",
  "dialogue.robin.marriage.Indoor_Day_2": "Keep your eyes peeled for good places to dig! It's a great way to find resources.",
  "dialogue.robin.marriage.Indoor_Day_3": "Thanks for always providing us such great food and ingredients.#$e#Here, I made you snack. [196 223 604 610 651]",
  "dialogue.robin.marriage.Indoor_Day_4": "Good morning, @! Here, have some coffee.[395]$h#$e#My mornings are better with a nice cup of coffee.",
  "dialogue.robin.marriage.Indoor_Night_0": "Do you want to go to bed early?$5",
  "dialogue.robin.marriage.Indoor_Night_1": "We should go stargazing some night. Maru taught me a lot about the stars.",
  "dialogue.robin.marriage.Indoor_Night_2": "I love spending evenings with you.",
  "dialogue.robin.marriage.Indoor_Night_3": "I never thought I'd receive another mermaid's pendant! I feel so fortunate to have you.",
  "dialogue.robin.marriage.Indoor_Night_4": "I wonder if Emily would make me a new outfit to wear at home.#$e#Maybe something skimpy.$5",
  "dialogue.robin.marriage.Indoor_Night_Robin": "You're always working so hard for us.#$e#Let me help you relax tonight.$5",
  "dialogue.robin.marriage.Outdoor_0": "It's so beautiful here. We're very fortunate.#$e#Could you imagine being stuck inside working in a cubicle today?",
  "dialogue.robin.marriage.Outdoor_1": "I have a few small repairs to make on the house today. I want to take care of them now before they become a big issue.",
  "dialogue.robin.marriage.Outdoor_2": "Today's going to be great, I can feel it.",
  "dialogue.robin.marriage.Outdoor_3": "Do you ever buy supplies from Marnie?#$b#I think some of her prices are a little high.",
  "dialogue.robin.marriage.Outdoor_4": "Don't forget to stay hydrated, dear.#$e#Make sure to get something to eat, too. Keep your energy up!$h",
  "dialogue.robin.marriage.OneKid_0": "Have you spent any time with %kid1 today? One of us probably should.",
  "dialogue.robin.marriage.OneKid_1": "I had a wild dream where %kid1 turned into a dove and flew away. It was pretty creepy.",
  "dialogue.robin.marriage.OneKid_3": "I forgot how much work it is to be a parent. I'm glad you help out so much.",
  "dialogue.robin.marriage.TwoKids_3": "I love you and the kids so much. Our life together has really turned out well.",
  "dialogue.robin.marriage.Good_0": "I thought I might miss the mountain, but I really love living in the valley.",
  "dialogue.robin.marriage.Good_1": "I got flustered the first time we met.$l#$b# Sorry if I came off a little rude.$h",
  "dialogue.robin.marriage.Good_2": "@? I love you. Have a great day today.",
  "dialogue.robin.marriage.Good_3": "Wow, you look great today!$l^You look beautiful today.$l",
  "dialogue.robin.marriage.Good_4": "Mmm... You smell nice today.",
  "dialogue.robin.marriage.Good_5": "I was just admiring my wedding amulet... I cherish it as much as I cherish you.$l",
  "dialogue.robin.marriage.Good_6": "Take care of yourself out there! Sometimes I worry about you falling into a mine shaft.",
  "dialogue.robin.marriage.Good_7": "@? I just want to say that I appreciate all the hard work you do for our household.$h",
  "dialogue.robin.marriage.Good_8": "I've got a lot to do today. Don't worry about me, go and have a great day.$l",
  "dialogue.robin.marriage.Good_9": "I love our life here.$h",
  "dialogue.robin.marriage.Neutral_0": "I look forward to growing old with you.",
  "dialogue.robin.marriage.Neutral_1": "Did anyone live here before your grandfather?",
  "dialogue.robin.marriage.Neutral_2": "What do you have going on today?",
  "dialogue.robin.marriage.Neutral_3": "If you go into town, make sure and say hi to everyone for me.",
  "dialogue.robin.marriage.Neutral_4": "I'm going to clean the fridge tomorrow.",
  "dialogue.robin.marriage.Neutral_5": "I wish we had a bank to keep our money in. I guess our town is just too small to have one.",
  "dialogue.robin.marriage.Neutral_6": "I wonder what the other moms are doing today?",
  "dialogue.robin.marriage.Neutral_7": "I don't really feel like doing anything today.",
  "dialogue.robin.marriage.Neutral_8": "It's amazing how clean we're able to keep the house.#$e#I thought it would be worse living on a farm.",
  "dialogue.robin.marriage.Neutral_9": "I hope we'll live here our entire lives.",
  "dialogue.robin.marriage.Bad_0": "@, do you still love me?$s",
  "dialogue.robin.marriage.Bad_1": "*sigh*... Did we get married too fast?$s",
  "dialogue.robin.marriage.Bad_2": "Are you still happy with me?$s",
  "dialogue.robin.marriage.Bad_3": "Is everything OK between us? You've been acting different lately.$s",
  "dialogue.robin.marriage.Bad_4": "Do you ever wonder what else is out there?$s",
  "dialogue.robin.marriage.Bad_5": "You used to be romantic... what happened?$s#$e#Maybe you should try to spend a little more time with me.$a",
  "dialogue.robin.marriage.Bad_6": "Is this the life you envisioned when you asked me to marry you?$s",
  "dialogue.robin.marriage.Bad_7": "Do you remember when you used to work on our relationship$s",
  "dialogue.robin.marriage.Bad_8": "You've been so distant lately...$s",
  "dialogue.robin.marriage.Bad_9": "I wonder if this was all a huge mistake.$s",
  "dialogue.robin.marriage.spring_2": "What do you have planned for spring this year?",
  "dialogue.robin.marriage.spring_1": "Wow, you sure know how to bring a girl into the new year...$l",
  "dialogue.robin.marriage.spring_12": "The egg festival is tomorrow. Do you think Abigail will enter the egg hunt?",
  "dialogue.robin.marriage.spring_10": "I love spring cleaning. It feels great to get everything clean and organized.$h",
  "dialogue.robin.marriage.summer_1": "It's summer! Bring on the warm weather.$h",
  "dialogue.robin.marriage.summer_9": "You really had me sweating last night, especially in this heat.$l",
  "dialogue.robin.marriage.summer_2": "Do you have any big plans for this summer?#$e#Wow, really?",
  "dialogue.robin.marriage.fall_1": "I love fall. The colors are glorious.",
  "dialogue.robin.marriage.fall_20": "We should make sure we're ready for winter. Do we have enough hay to last the season?",
  "dialogue.robin.marriage.fall_2": "All of the best things happen in fall. The fair, Spirit's Eve, my birthday...$h",
  "dialogue.robin.marriage.winter_1": "It's winter! Have you ever heard rumors about the Glacier Fish?#$b#I wonder if it really exists.",
  "dialogue.robin.marriage.winter_7": "Tomorrow is the Festival of Ice. I wonder what crazy sculpture Abigail will create.",
  "dialogue.robin.marriage.winter_28": "It's New Year's Eve; let’s have fun tonight!! [348]$h#$e#I'm so looking forward to a new year with you.",
  "dialogue.robin.marriage17.funLeave_Robin": "",
  "dialogue.robin.marriage17.funReturn_Robin": "Oh. You're home.",
  "dialogue.robin.marriage811.funLeave_Robin.1": "I look forward to growing old with you.",
  "dialogue.robin.marriage811.funLeave_Robin.2": "Did anyone live here before your grandfather?",
  "dialogue.robin.marriage811.funLeave_Robin.3": "What do you have going on today?",
  "dialogue.robin.marriage811.funLeave_Robin.4": "If you go into town make sure and say hi to everyone for me.",
  "dialogue.robin.marriage811.funLeave_Robin.5": "I'm going to clean the fridge tomorrow.",
  "dialogue.robin.marriage811.funLeave_Robin.6": "I wish we had a bank to keep our money in. I guess our town is just too small to have one.",
  "dialogue.robin.marriage811.funLeave_Robin.7": "I wonder what the other moms are doing today?",
  "dialogue.robin.marriage811.funLeave_Robin.8": "I don't really feel like doing anything today.",
  "dialogue.robin.marriage811.funLeave_Robin.9": "It's amazing how clean we're able to keep the house.#$e#I thought it would be a little messy living on a farm.",
  "dialogue.robin.marriage811.funLeave_Robin.10": "I hope we'll live here our entire lives.",
  "dialogue.robin.marriage811.funReturn_Robin": "Welcome home, hon. How was your day?",
  "dialogue.robin.marriage1214.funLeave_Robin.1": "I thought I might miss the mountain but I really love living in the valley.",
  "dialogue.robin.marriage1214.funLeave_Robin.2": "I got flustered the first time we met.$l#$b# Sorry if I came off a little rude.$h",
  "dialogue.robin.marriage1214.funLeave_Robin.3": "@? I love you. Have a great day today.",
  "dialogue.robin.marriage1214.funLeave_Robin.4": "You look great today!$l^You look beautiful today!$l",
  "dialogue.robin.marriage1214.funLeave_Robin.5": "I was just admiring my wedding amulet... I cherish it as much as I cherish you.$l",
  "dialogue.robin.marriage1214.funLeave_Robin.6": "Take care of yourself out there! Sometimes I worry about you falling into a mine shaft.",
  "dialogue.robin.marriage1214.funLeave_Robin.7": "@? I just want to say that I appreciate all the hard work you do for our household.$h",
  "dialogue.robin.marriage1214.funLeave_Robin.8": "I've got a lot to do today so don't worry about me. Go and have a great day.$l",
  "dialogue.robin.marriage1214.funLeave_Robin.9": "I love our life here.$h",
  "dialogue.robin.marriage1214.funReturn_Robin": "Hi Sweetie! I'm so glad you're home.",
  //events
  "event.robin.7.0": "Oh, hey, @. I'm glad I caught you.#$b#I need some advice, and since we're good friends now, I wanted to ask your opinion.",
  "event.robin.7.1": "It's no secret that Demetrius and I haven't been getting along too well for a while now.#$b#We had a long talk last night, and I'm not sure how committed he is to working on our marriage.$2",
  "event.robin.7.2": "He made it clear that his work is very important to him.$6",
  "event.robin.7.3": "What do you think I should do, @?",
  "event.robin.7.4": "How should I answer?#Explore your options. You can create a great life on your own or with someone else here.#Stick with Demetrius and keep your comfy life together. Why risk being all by yourself?",
  "event.robin.7.5": "*sigh* You're probably right. Thanks for listening and being such a good friend.",
  "event.robin.single.0": "You know, I think that's what I've already been feeling in my heart. I just needed to hear someone else say it.#$b#My kids are here and I have great friends here.#$b#I can make a wonderful life here! Thanks for the advice, @. I'm feeling positive about what the future holds!",
  "event.robin.8.0": "Hi @, I was just coming to see you!$1#$b#Do you have a moment? I want to tell you something.",
  "event.robin.8.1": "You know, after everything with Demetrius... I didn't expect to feel anything again, at least not this soon.",
  "event.robin.8.2": "I've realized something over the past little while.#$b#You've been an amazing friend to me.#$b#You're super supportive, a great listener and you've provided such thoughtful advice.#$b#We've spent a lot of time together and I... well, I've started to feel something deeper.$2",
  "event.robin.8.3": "@... I think I'm falling for you.$7",
  "event.robin.8.4": "But listen, no pressure, OK?",
  "event.robin.8.5": "I just wanted to tell you that whatever the future holds, @. I hope you'll always be in my life.",
  "event.robin.8.6": "So, with that said, um, would you like to head back to your place... and, you know, spend some quality time together?$7",
  "event.robin.10.0": "Hi, @. Can we talk for a minute?$2",
  "event.robin.10.1": "I know this might be a bit awkward, but I just wanted to say that I'm completely cool with you and Robin being together.$2",
  "event.robin.10.2": "Our relationship struggled for quite a while.#$b#It was really hard on her.$2",
  "event.robin.10.3": "I was never able to find the time to analyze why. I'm not even sure I gathered enough raw data.",
  "event.robin.10.4": "Anyway, she's a remarkable person, and I'm glad she's found someone who makes her so happy.$0",
  "event.robin.10.5": "I'm actually happy for both of you.#$b#It had to be pretty lonely for you when you left your old life and moved here all alone.#$b#I'm glad you found someone, too.$0",
  "event.robin.10.6": "Thanks for hearing me out, @. I appreciate it.#$b#Sorry that this was weird and awkward.$0",
  "event.robin.10.7": "Hey, let's all grab a coffee sometime.$0#$b#Unless you're afraid I'll try to steal your girl back.$1",
  "event.robin.11.0": "Hi, @! I'm so glad you came by.$1",
  "event.robin.11.1": "I just realized something!",
  "event.robin.11.2": "Now that we're a couple, it doesn't make sense for me to charge you full price for items in my shop.",
  "event.robin.11.3": "Any profit just comes back into our household.",
  "event.robin.11.4": "Except that Lewis will keep some of it as taxes.$3",
  "event.robin.11.5": "From now on you can buy everything at cost, which is 50% off of the regular price.$0",
  "event.robin.11.6": "I can't believe we didn't think of this sooner!$1",
  "event.robin.14.0": "You found me.$1",
  "event.robin.14.1": "Sometimes I come up here after work... when the light is perfect and the mountains turn gold.",
  "event.robin.14.2": "It’s peaceful. Quiet. No hammering. No sawing.",
  "event.robin.14.3": "When I left my old life... it was terrifying.",
  "event.robin.14.4": "I had a rhythm, you know? Wake up. Take care of the kids. Build. Make dinner. Keep myself busy.",
  "event.robin.14.5": "I thought that was normal. That love just... settled into silence.",
  "event.robin.14.6": "But with you, it's different. You see me — even the parts I used to tuck away to make space for others.",
  "event.robin.14.7": "And you don't just see them... you *love* them.",
  "event.robin.14.8": "I didn't know I could feel this full. This whole.",
  "event.robin.14.9": "I didn’t think I’d ever find something like this again. ",
  "event.robin.14.10": "But here you are. I love you, @.",
  "event.robin.14.11": "Ready to walk home together?",
  //festivals
  "festival.summer11.Robin": "I hope Demetrius will spend some time with Maru and Sebby today",
  "festival.summer11.Demetrius": "I just spoke with Sebby & Maru, they both seem to be enjoying themselves.",
  "festival.summer11.Robin_y2": "I'm hoping that Demetrius will hang out with Sebby and Maru today.",
  "festival.summer11.Demetrius_y2": " Sebby, Maru and I are going to eat together after the ceremony.",
  "festival.winter25.Robin": "Hiya, @. You're welcome to join me if you need company.$h"
}