{
  "Changes": [
    {
      "LogName": "Sebastian dialog updates",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Sebastian",
      "Entries": {
        "dating_Robin_memory_oneday": "It’s funny. I used to picture you and me, but I see now that you and Mom are a perfect match.",
        "married_Robin": "So now I have another stepdad, huh? That's going to take some getting used to.^So now I have a stepmom and a stepdad, huh? That's going to take some getting used to."
      }
    },
    {
      "LogName": "Sebastian dialog updates - Robin & Demetrius drifting apart",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Sebastian",
      "Entries": {
        "Thu2": "Demetrius has been working a lot lately, but I guess it just means more quiet around here.",
        "Sat4": "I've noticed Demetrius's been putting in some crazy hours lately. I guess he's trying to get ahead.",
        "Fri6": "Mom's been asking if I've seen Demetrius. As if I leave the basement enough to notice.",
        "Fri8": "Demetrius has been putting in a lot of long hours. Mom seems to care, but I barely notice.",
        "Sat8": "Demetrius used to bug me about getting out of my room more. Now he's working all the time himself.",
        "Thu10": "Mom seems frustrated about Demetrius working so much, but honestly, it just feels like things are quieter now.",
        "Sat10": "You know, I actually had a conversation with Demetrius last week. Feels like a rare achievement these days."
      },
      "When": {
        "Relationship:Robin |contains=Married": "false", //not living at farm (includes divorced)
        "HasFlag |contains=DateableRobin": "false"
      }
    },
    {
      "LogName": "Sebastian dialog updates - Robin & Demetrius split",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Sebastian",
      "Entries": {
        "dating_Robin_memory_oneday": "It’s funny. I used to picture you and me, but I see now that you and Mom are a perfect match.",
        "married_Robin": "So now I have another stepdad, huh? That's going to take some getting used to.^So now I have a stepmom and a stepdad, huh? That's going to take some getting used to.",
        "Thu2": "Mom moving into Maru's room didn't change much for me. I'm still doing my own thing.",
        "Sat4": "Mom and Demetrius finally separated. I guess this was inevitable.",
        "Fri6": "So... Mom & Demetrius separated. Plot twist: they're both still in the house. Mom's in Maru's room, Demetrius is still here, and I'm in my basement, pretending this is all totally normal.",
        "Fri8": "So, Mom's bunking in Maru's room now. Guess the family tree's getting a pruning.",
        "Sat8": "The whole thing with Mom and Demetrius splitting feels awkward, but as long as they leave me alone, I'm good.",
        "Thu10": "So, Mom moved into Maru's room. It's like we're all here but not really together, you know?",
        "Sat10": "Mom's staying in Maru's room now... Kind of weird, but I just stay out of the way."
      },
      "When": {
        "Relationship:Robin |contains=Married": "false", //not living at farm (includes divorced)
        "HasFlag": "DateableRobin"
      }
    }
  ]
}