{
  "Changes": [
    {
      "LogName": "Robin's engagement dialog",
      "Action": "EditData",
      "Target": "Data/EngagementDialogue",
      "Entries": {
        "Robin0": "I'm so looking forward to being married to you, @.$1#$b# Like they say, the third time is the charm!$4",
        "Robin1": "I can't wait to live with you on the farm. We're going to have a great life together."
      }
    },
    {
      "LogName": "Update Robin's core dialog",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Robin",
      "Entries": {
        "AcceptBouquet": "You want to get serious?#$b#Me too!$1#$b#I'm so glad you feel the same way.$l",
        "Sun6": "{{i18n:Robin.Dialogue.Sun6}}",
        "dating_Robin": "Let me tell Demetrius and the kids that we're dating.#$b#They should hear it from me first.",
        "dating_Robin_memory_oneday": "I'm feeling very scattered today.$l",
        "dating_Robin_memory_oneyear": "We've been dating for a year already! We should celebrate tonight.$h",
        "FlowerDance_Accept_Spouse": "Of course...#$b#*whisper* I'm glad you asked. I'll reward you later.$l",
        "FlowerDance_Accept": "Yes, I'd love to dance with you!",
        "divorced": "Leave me alone. Thanks to you, I'm a three time loser.$a#$b#Please, just go away.$s",
        "RejectBouquet_Divorced": "Get lost.",
        "breakUp": "I risked my marriage and family because I thought you were serious.$a#$b#I was such a fool.$s",
        "Mon2": "Demetrius has been really busy with his research lately. I hope starts getting more rest soon.",
        "Wed2": "Demetrius is always buried in his research. I wonder if his workload will ever get lighter.",
        "Sun2": "Demetrius has been spending a lot of late nights at the lab. He's really dedicated to his work.",
        "Mon4": "Demetrius is working something big, but I sometimes miss just hanging out together.",
        "Thu4": "I miss having dinners with Demetrius. I'm feeling less connected to him.",
        "Wed4": "I understand Demetrius' work is important, but there's a distance between us that I can't seem to bridge.",
        "Sat6": "Demetrius' job is more important to him than anything else. I'm grateful that I have my own career.#$e#I really love carpentry.'",
        "Thu6": "Demetrius isn't spending much time with the family, but I think the kids and I are growing even closer.",
        "Mon6": "I have a lot of evening time to myself these days. I haven't had this much time to read since before Sebby was born.",
        "Wed6": "It's no secret I'm feeling lonely, but at least I have a stable life here.#$b#I'm luckier than many others."
      }
    },
    {
      "LogName": "Robin's friendly saloon dialog 4+ hearts",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Robin",
      "Entries": {
        "Saloon_Fri": "{{Random: I guess Demetrius isn't coming dancing tonight.#$e#I wish he could break away from work.$2, I guess I'm alone again tonight.#$e#Demetrius doesn’t seem to come dancing anymore.$2, Demetrius is missing out on dancing again.#$e#Do you think he misses it?$2}}"
      },
      "When": {
        "query: {{Hearts:Robin}} >= 4": true,
        "Relationship:Robin": "Friendly"
      }
    },
    {
      "LogName": "Robin's dateable dialog, she & Demetrius have divorced",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Robin",
      "Entries": {
        "Sat8": "Demetrius' job is more important to him than anything else. I’m glad I finally decided to move on.",
        "Thu8": "I tried talking to Demetrius about spending more time with the family, but he just didn't listen. His research always came first.",
        "Mon8": "Demetrius and I have decided to separate. We've filed for divorce with Mayor Lewis.#$b#I really appreciate your advice earlier. I'm at peace with our decision.",
        "Fri8": "I've been sleeping in Maru's room now that Demetrius and I are divorced. It's kind of her to make some space for me.#$e#She's really wonderful.",
        "Wed8": "I'm looking forward to a bright future! I hope you'll always be a part of it."
      },
      "When": {
        "HasFlag": "RobinDateable"
      }
    },
    {
      "LogName": "Robin's green rain dialog",
      "Action": "EditData",
      "Target": "Characters/Dialogue/Robin",
      "Entries":
      {
        "GreenRain": "Demetrius made us all very afraid of the green rain but I'm much more relaxed about it now.#$b#I'm still going to take the day off, though.$4",
        "GreenRainFinished": "I'm not thrilled about the green rain. But I sure enjoyed a day off!$h"
      },
      "When": {
        "Spouse": "Robin"
      }
    }
  ]
}