{
  "Changes": [
    {
      "Action": "Load",
      "Target": "Characters/Dialogue/MarriageDialogueRobin",
      "FromFile": "assets/dialogue/empty.json"
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueRobin",
      "Entries":
        {
          "spring_Tue": "The valley is so pretty in Spring. I'll enjoy the view on my walk to town for Tuesday workout.",
          "summer_Tue": "Remember that I'm taking the day off today. I'll be at the gym.#$e#It's leg day.$2",
          "fall_Tue": "The leaves are so pretty on my walk to town. Tuesdays in autumn are my favorite.",
          "winter_Tue": "It's gossip and gym day! See you this evening, honey.",
          "spouseRoom_Robin": "I'm looking for some design inspiration.#$e#I love having all of my books here.",
          "Rainy_Day_0": "Let me know if you need any help today.",
          "Rainy_Day_1": "Rainy days let you know what condition your roof is in. Luckily, we're in good shape!",
          "Rainy_Day_2": "Good morning! I got up early and made breakfast. Here you go.[194 195 201 210 211]#$e#I hope it tastes OK. I'm a better carpenter than I am a cook.$h",
          "Rainy_Day_3": "Days like this can feel really long when you're working outdoors.",
          "Rainy_Day_4": "It's pouring out there. We should lay around in bed all day.$5",
          "Rainy_Night_0": "How was your rainy day? I'm impressed that you were out there getting things done!",
          "patio_Robin": "I love having this space. I hope I figure out what to do with it some day.",
          "Rainy_Night_1": "I could really go for some fried chicken. Someone should invent that!$h",
          "Rainy_Night_2": "The sound of the rain just lulls me to sleep...",
          "Rainy_Night_3": "I made soup! I threw it out though, it was awful.$h#$b#Do you want to get takeout from Gus?",
          "Rainy_Night_4": "I'm glad you're home... Let's hop in bed and warm each other up.$5",
          "Rainy_Night_Robin": "How was your day today, dear? Are you cold?",
          "Indoor_Day_0": "This house is holding up well! It's still in great shape.",
          "Indoor_Day_1": "Good morning, @. I found this when I was out yesterday... [384 386 787 107 70 114]#$e#I hope you can use it.",
          "Indoor_Day_2": "Keep your eyes peeled for good places to dig! It's a great way to find resources.",
          "Indoor_Day_3": "Thanks for always providing us such great food and ingredients.#$e#Here, I made you snack. [196 223 604 610 651]",
          "Indoor_Day_4": "Good morning, @! Here, have some coffee.[395]$h#$e#My mornings are better with a nice cup of coffee.",
          "Indoor_Night_0": "Do you want to go to bed early?$5",
          "Indoor_Night_1": "We should go stargazing some night. Maru taught me a lot about the stars.",
          "Indoor_Night_2": "I love spending evenings with you.",
          "Indoor_Night_3": "I never thought I'd receive another mermaid's pendant! I feel so fortunate to have you.",
          "Indoor_Night_4": "I wonder if Emily would make me a new outfit to wear at home.#$e#Maybe something skimpy.$5",
          "Indoor_Night_Robin": "You're always working so hard for us.#$e#Let me help you relax tonight.$5",
          "Outdoor_0": "It's so beautiful here. We're very fortunate.#$e#Could you imagine being stuck inside working in a cubicle today?",
          "Outdoor_1": "I have a few small repairs to make on the house today. I want to take care of them now before they become a big issue.",
          "Outdoor_2": "Today's going to be great, I can feel it.",
          "Outdoor_3": "Do you ever buy supplies from Marnie?#$b#I think some of her prices are a little high.",
          "Outdoor_4": "Don't forget to stay hydrated, dear.#$e#Make sure to get something to eat, too. Keep your energy up!$h",
          "OneKid_0": "Have you spent any time with %kid1 today? One of us probably should.",
          "OneKid_1": "I had a wild dream where %kid1 turned into a dove and flew away. It was pretty creepy.",
          "OneKid_3": "I forgot how much work it is to be a parent. I'm glad you help out so much.",
          "TwoKids_3": "I love you and the kids so much. Our life together has really turned out well.",
          "Good_0": "I thought I might miss the mountain, but I really love living in the valley.",
          "Good_1": "I got flustered the first time we met.$l#$b# Sorry if I came off a little rude.$h",
          "Good_2": "@? I love you. Have a great day today.",
          "Good_3": "Wow, you look great today!$l^You look beautiful today.$l",
          "Good_4": "Mmm... You smell nice today.",
          "Good_5": "I was just admiring my wedding amulet... I cherish it as much as I cherish you.$l",
          "Good_6": "Take care of yourself out there! Sometimes I worry about you falling into a mine shaft.",
          "Good_7": "@? I just want to say that I appreciate all the hard work you do for our household.$h",
          "Good_8": "I've got a lot to do today. Don't worry about me, go and have a great day.$l",
          "Good_9": "I love our life here.$h",
          "Neutral_0": "I look forward to growing old with you.",
          "Neutral_1": "Did anyone live here before your grandfather?",
          "Neutral_2": "What do you have going on today?",
          "Neutral_3": "If you go into town, make sure and say hi to everyone for me.",
          "Neutral_4": "I'm going to clean the fridge tomorrow.",
          "Neutral_5": "I wish we had a bank to keep our money in. I guess our town is just too small to have one.",
          "Neutral_6": "I wonder what the other moms are doing today?",
          "Neutral_7": "I don't really feel like doing anything today.",
          "Neutral_8": "It's amazing how clean we're able to keep the house.#$e#I thought it would be worse living on a farm.",
          "Neutral_9": "I hope we'll live here our entire lives.",
          "Bad_0": "@, do you still love me?$s",
          "Bad_1": "*sigh*... Did we get married too fast?$s",
          "Bad_2": "Are you still happy with me?$s",
          "Bad_3": "Is everything OK between us? You've been acting different lately.$s",
          "Bad_4": "Do you ever wonder what else is out there?$s",
          "Bad_5": "You used to be romantic... what happened?$s#$e#Maybe you should try to spend a little more time with me.$a",
          "Bad_6": "Is this the life you envisioned when you asked me to marry you?$s",
          "Bad_7": "Do you remember when you used to work on our relationship$s",
          "Bad_8": "You've been so distant lately...$s",
          "Bad_9": "I wonder if this was all a huge mistake.$s",
          "spring_2": "What do you have planned for spring this year?",
          "spring_1": "Wow, you sure know how to bring a girl into the new year...$l",
          "spring_12": "The egg festival is tomorrow. Do you think Abigail will enter the egg hunt?",
          "spring_10": "I love spring cleaning. It feels great to get everything clean and organized.$h",
          "summer_1": "It's summer! Bring on the warm weather.$h",
          "summer_9": "You really had me sweating last night, especially in this heat.$l",
          "summer_2": "Do you have any big plans for this summer?#$e#Wow, really?",
          "fall_1": "I love fall. The colors are glorious.",
          "fall_20": "We should make sure we're ready for winter. Do we have enough hay to last the season?",
          "fall_2": "All of the best things happen in fall. The fair, Spirit's Eve, my birthday...$h",
          "winter_1": "It's winter! Have you ever heard rumors about the Glacier Fish?#$b#I wonder if it really exists.",
          "winter_7": "Tomorrow is the Festival of Ice. I wonder what crazy sculpture Abigail will create.",
          "winter_28": "It's New Year's Eve; let’s have fun tonight!! [348]$h#$e#I'm so looking forward to a new year with you."
        }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueRobin",
      "Entries":
      {
        "funLeave_Robin": "{{Random: *sigh*... Did we get married too fast?$s, Are you still happy with me?$s,Is everything OK between us? You've been acting different lately.$s, Do you ever wonder what else is out there?$s, You used to be romantic... what happened?$s#$e#Maybe you should try to spend a little more time with me.$a, Is this the life you envisioned when you asked me to marry you?$s, Do you remember when you used to work on our relationship$s, You've been so distant lately...$s, I wonder if this was all a huge mistake.$s}}",        "funReturn_Robin": "Oh. You're home."
      },
      "When": {
        "Hearts:Robin": "{{Range: 1, 7}}"
      }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueRobin",
      "Entries":
      {
        "funLeave_Robin": "{{Random: I look forward to growing old with you., Did anyone live here before your grandfather?, What do you have going on today?, If you go into town make sure and say hi to everyone for me., Im going to clean the fridge tomorrow., I wish we had a bank to keep our money in. I guess our town is just too small to have one., I wonder what the other moms are doing today?, I dont really feel like doing anything today., Its amazing how clean were able to keep the house.#$e#I thought it would be worse living on a farm., I hope well live here our entire lives.}}",        "funReturn_Robin": "Welcome home, hon. How was your day?"
      },
      "When": {
        "Hearts:Robin": "{{Range: 8, 11}}"
      }
    },
    {
      "Action": "EditData",
      "Target": "Characters/Dialogue/MarriageDialogueRobin",
      "Entries": {
        "funLeave_Robin": "{{Random: I thought I might miss the mountain but I really love living in the valley., I got flustered the first time we met.$l#$b# Sorry if I came off a little rude.$h, @? I love you. Have a great day today., You look great today!$l^You look beautiful today!$l, Mmm... You smell nice today., I was just admiring my wedding amulet... I cherish it as much as I cherish you.$l, Take care of yourself out there! Sometimes I worry about you falling into a mine shaft., @? I just want to say that I appreciate all the hard work you do for our household.$h, I've got a lot to do today so don't worry about me. Go and have a great day.$l, I love our life here.$h}}",
        "funReturn_Robin": "Hi Sweetie! I'm so glad you're home."
      },
      "When": {
        "Hearts:Robin": "{{Range: 12, 14}}"
      }
    }
  ]
}